{
  "backend/main.mo": "Main canister actor implementing authorization, user profile storage, and full CRUD for categories with admin checks and ordering operations.",
  "backend/migration.mo": "Migration module converting old actor state to a new state shape by adding an empty storeDetails map.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference file containing prewritten one‑sentence summaries for multiple frontend files.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and applying base styling.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Initializes the TanStack Router and renders the ToastViewport for global toasts.",
  "frontend/src/components/admin/AccessDenied.tsx": "Admin access‑denied page showing the user's principal and allowing logout via Internet Identity and auth store reset.",
  "frontend/src/components/admin/AdminHeader.tsx": "Header bar with sidebar toggle, brand link, and logout logic clearing auth and navigation state.",
  "frontend/src/components/admin/AdminLoginPanel.tsx": "Login panel UI using Internet Identity with loading feedback.",
  "frontend/src/components/admin/AdminSidebar.tsx": "Admin navigation sidebar with mobile overlay and active-route highlighting.",
  "frontend/src/components/admin/AdminVerificationLoading.tsx": "Centered loading screen displayed while verifying admin permissions.",
  "frontend/src/components/admin/CopyIconButton.tsx": "Icon button that copies a provided string to the clipboard with success indication.",
  "frontend/src/components/admin/DashboardNavCard.tsx": "Clickable dashboard card that navigates to a specified admin path with icon and title.",
  "frontend/src/components/admin/products/CategoryFilterSelect.tsx": "Category filter select component using SafeSelect with sentinel values and category query.",
  "frontend/src/components/admin/products/DeleteProductDialog.tsx": "Confirmation dialog requiring a password to delete a product via mutation.",
  "frontend/src/components/admin/products/ProductsPagination.tsx": "Pagination controls with page size selection and numbered navigation for product lists.",
  "frontend/src/components/admin/products/ProductsTable.tsx": "Renders a table of products with copy, edit, delete, and in‑stock toggle actions, handling loading and empty states.",
  "frontend/src/components/admin/products/ProductUpsertModal.tsx": "Modal for creating or editing products with form handling, validation, image upload, and mutations.",
  "frontend/src/components/admin/sales/DeleteSaleItemDialog.tsx": "Confirmation dialog to delete a sale item, calling a delete mutation and handling pending state.",
  "frontend/src/components/admin/sales/SaleItemDeactivateDialog.tsx": "Dialog asking for confirmation before deactivating a sale item, triggering a provided callback.",
  "frontend/src/components/admin/sales/SaleItemsCards.tsx": "Displays sale items as cards with thumbnails, pricing, status, and controls for edit, delete, and active toggling.",
  "frontend/src/components/admin/sales/SaleItemsFilters.tsx": "Provides UI controls to filter sale items by status and date range.",
  "frontend/src/components/admin/sales/SaleItemsPagination.tsx": "Pagination controls with page navigation, size selection, and range display for sale item lists.",
  "frontend/src/components/admin/sales/SaleItemsTable.tsx": "Renders a table of sale items with thumbnail loading, activation toggling, edit/delete actions, and a deactivation confirmation dialog.",
  "frontend/src/components/admin/sales/SaleItemStatusBadge.tsx": "Displays a visual status badge for a sale item based on its computed status.",
  "frontend/src/components/admin/sales/SaleItemUpsertModal.tsx": "Modal for creating or editing sale items with product search, form state, validation, and mutation handling.",
  "frontend/src/components/admin/sales/useProductThumbnail.ts": "Fetches a product photo via actor API, returning a blob URL or placeholder with caching via React Query.",
  "frontend/src/components/admin/store-details/StoreDetailsActions.tsx": "Buttons for saving or restoring store details, showing disabled and loading states.",
  "frontend/src/components/admin/store-details/StoreDetailsForm.tsx": "Form for editing store details including name, contact info, address, description, and hours with validation handling.",
  "frontend/src/components/admin/store-details/StoreDetailsPreview.tsx": "Displays a formatted preview of store details including contact info and hours.",
  "frontend/src/components/categories/CategorySelect.tsx": "Dropdown component that loads categories from backend and displays them with loading and empty states.",
  "frontend/src/components/SafeSelect.test.tsx": "Empty test file placeholder for SafeSelect component tests.",
  "frontend/src/components/SafeSelect.tsx": "Safe wrapper around shadcn Select enforcing non‑empty values using sentinel values and conversion helpers.",
  "frontend/src/components/toast/ToastCard.tsx": "A toast notification card with timed auto-dismiss, pause-on-hover, animations, and type-specific icons.",
  "frontend/src/components/toast/ToastViewport.tsx": "Container rendering all active toasts from the toast store.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, auto-reinitializing and invalidating queries on identity changes.",
  "frontend/src/hooks/useAdminVerification.ts": "Verifies admin permissions using the actor, updating auth state and handling errors with toasts.",
  "frontend/src/hooks/useCategoryOptions.ts": "Loads all categories and maps them into dropdown-ready option objects with loading and empty-state info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useProductQueries.ts": "Defines React Query hooks for fetching and mutating product data, converting backend bigint fields to UI-friendly numbers.",
  "frontend/src/hooks/useProductSearchForSales.ts": "Implements a debounced product search hook for sales creation, converting backend results and filtering out items without prices.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for category CRUD operations, converting backend bigints and managing category cache updates.",
  "frontend/src/hooks/useRequireAdminNavigation.ts": "Redirects non-admin authenticated users away from protected routes and exposes access and verification status.",
  "frontend/src/hooks/useSaleItemQueries.ts": "Provides hooks for querying and mutating sale items, including status/date filtering and bigint-to-number conversion.",
  "frontend/src/hooks/useStoreDetailsQueries.ts": "Implements hooks to fetch and update store details, converting between backend formats, parsing coordinates and store hours.",
  "frontend/src/hooks/useSyncAuthFromInternetIdentity.ts": "Syncs the principal from Internet Identity into the app's auth store whenever the identity changes.",
  "frontend/src/index.css": "Configures Tailwind layers, defines light/dark theme color variables, and includes custom toast notification styles.",
  "frontend/src/layouts/admin/DashboardLayout.tsx": "Provides the admin dashboard layout with header, sidebar toggle, and main content wrapper.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/admin/AdminRoute.tsx": "Handles admin authentication, identity sync, admin verification, and wraps protected routes in the dashboard layout.",
  "frontend/src/pages/admin/CategoriesPage.tsx": "Implements category management with search, CRUD modals, validation, and table display.",
  "frontend/src/pages/admin/DashboardHomePage.tsx": "Shows admin dashboard overview with navigation cards linking to management sections.",
  "frontend/src/pages/admin/ExportPage.tsx": "Displays a simple placeholder page for future data export functionality.",
  "frontend/src/pages/admin/OnSaleProductsPage.tsx": "Manages on-sale products with search, filters, pagination, and create/edit/delete modals.",
  "frontend/src/pages/admin/ProductsPage.tsx": "Manages products with search, category filtering, pagination, and CRUD modals.",
  "frontend/src/pages/admin/StoreDetailsPage.tsx": "Admin page that loads, edits, validates, and saves details for two stores using tabs and form state management.",
  "frontend/src/router.tsx": "Defines the TanStack router tree for admin pages including products, categories, store details, and export.",
  "frontend/src/stores/authStore.ts": "Zustand store managing authentication state, admin status checks, and persistence.",
  "frontend/src/stores/toastStore.ts": "Zustand store for creating, storing, and clearing toast notifications with helper methods.",
  "frontend/src/utils/adminDate.ts": "Converts between date strings and nanosecond timestamps and validates date ranges for admin forms.",
  "frontend/src/utils/ApiResponseHandler.test.ts": "Empty test placeholder for API response handler.",
  "frontend/src/utils/ApiResponseHandler.ts": "Standardizes API response parsing with BigInt support and provides ApiError handling and retry logic.",
  "frontend/src/utils/BigIntSerializer.test.ts": "Empty test placeholder for BigInt serializer.",
  "frontend/src/utils/BigIntSerializer.ts": "Provides safe BigInt/string conversions and a JSON parser that auto-converts timestamp-related fields.",
  "frontend/src/utils/categoryNumeric.ts": "Provides safe conversions between UI numbers and bigint values for category IDs, order, and reorder arrays.",
  "frontend/src/utils/imageWebp.ts": "Provides image validation, WebP conversion, blob URL creation, and cleanup utilities.",
  "frontend/src/utils/NumericConverter.test.ts": "Empty test placeholder for numeric conversion utilities.",
  "frontend/src/utils/NumericConverter.ts": "Utility for safely converting numbers, validating IVA and margins, handling stock booleans, and formatting prices.",
  "frontend/src/utils/reportErrorWithToast.ts": "Logs detailed errors and shows toast notifications for errors, warnings, successes, and info messages.",
  "frontend/src/utils/storeDetailsValidation.ts": "Validates store details fields including email, phone, coordinates, and required text fields.",
  "frontend/src/utils/storeHoursFormat.ts": "Formats store hours into display-friendly lists and provides Spanish day labels.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, session persistence, and cleanup for both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Describes overall project configuration, architecture, requirements, and known issues."
}