{
  "kind": "build_request",
  "title": "Refactor backend product fetches to consistently return sale info and update frontend to display sale price",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Refactor the Motoko backend so that `getProductsPageFeaturedFirst`, `getHomepageCategories`, and `getProduct` consistently return products including sale information: `salePrice`, `discountPercentage`, and a boolean indicating whether the sale is active, while always including the product `price`.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Refactor the Motoko backend so that the following functions:\n\t•\tgetProductsPageFeaturedFirst\n\t•\tgetHomepageCategories\n\t•\tgetProduct\nall return products with sale information (sale price, discount percentage, and whether the sale is active)."
        ]
      },
      "acceptanceCriteria": [
        "`getProductsPageFeaturedFirst` returns items that include sale fields (`salePrice`, `discountPercentage`, and active-sale boolean) for each product.",
        "`getHomepageCategories` returns products within each category that include sale fields (`salePrice`, `discountPercentage`, and active-sale boolean).",
        "`getProduct` returns a single product response that includes sale fields (`salePrice`, `discountPercentage`, and active-sale boolean).",
        "In all three responses, `price` is present regardless of sale status (preserving the existing product `price` field behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a single shared Motoko helper that determines whether a product currently has an active sale using the existing sale rules, and attaches sale fields to the returned product data without changing the underlying stored data model.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Use a common helper function to calculate if a product has an active sale and attach the sale price and discount.\n\nSale logic should follow the existing rules:\n\t•\tIf a sale exists and is active, return salePrice and discountPercentage.\n\t•\tIf no sale exists, salePrice is null and discountPercentage is null.\n\t•\tprice should always be included.\n\nYou don’t need to change other functions or the data model—only refactor these three functions to consistently include sale info."
        ]
      },
      "acceptanceCriteria": [
        "A shared helper function is used by all three target functions to compute/attach sale info (no duplicated sale-computation logic across the three functions).",
        "If a sale exists for the product and it is active per existing rules, the response includes non-null `salePrice` and `discountPercentage` and the active-sale boolean is true.",
        "If no sale exists (or the sale is not active), `salePrice` is null and `discountPercentage` is null and the active-sale boolean is false.",
        "No changes are made to persisted record shapes for products or sale items (no data model/storage schema changes)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Preserve the existing pagination and sorting behavior of `getProductsPageFeaturedFirst` and `getHomepageCategories` while adding sale info, and follow Motoko best practices by using `map`/functional transformations and avoiding repeated loops where possible.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Keep Motoko best practices in mind: use map, avoid repeated loops, and maintain pagination and sorting logic."
        ]
      },
      "acceptanceCriteria": [
        "`getProductsPageFeaturedFirst` still returns the same `totalCount` semantics and featured-first ordering as before, with pagination (`page`, `pageSize`) unchanged.",
        "`getHomepageCategories` still preserves its existing pagination behavior for category loading and product ordering within categories, only adding sale info fields.",
        "Implementation uses a shared transformation (e.g., mapping over products once per response structure) rather than re-filtering/re-sorting multiple times for sale augmentation."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update frontend data fetching/mapping code that calls `getProductsPageFeaturedFirst`, `getHomepageCategories`, and `getProduct` so it uses the backend-provided sale fields (instead of defaulting sale fields to undefined/false), and ensure the UI displays the sale price when present; otherwise it displays the normal price.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ensure that all front-end pages using these functions display the sale price when it exists; otherwise, display the normal price."
        ]
      },
      "acceptanceCriteria": [
        "Category page / category product grids driven by `getProductsPageFeaturedFirst` render sale price when backend indicates the sale is active, otherwise render normal price.",
        "Homepage category sections driven by `getHomepageCategories` render sale price when backend indicates the sale is active, otherwise render normal price.",
        "Product detail views driven by `getProduct` render sale price when backend indicates the sale is active, otherwise render normal price.",
        "Frontend no longer hardcodes sale defaults for these endpoints (e.g., does not set `salePrice: undefined`, `discountPercentage: undefined`, `isOnSale: false` when backend returns real values)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture with logic in `backend/main.mo`.",
    "Do not change the persisted data model; only refactor the three specified functions and add shared helper logic needed to attach sale info.",
    "Do not modify frontend files under `frontend/src/components/ui` or any path listed in `frontend.immutablePaths`.",
    "Use English for any user-facing text in this build request."
  ],
  "nonGoals": [
    "Do not refactor or change behavior of other backend functions beyond what is required to keep types consistent for these three endpoints.",
    "Do not introduce new backend services, external databases, or third-party integrations.",
    "Do not redesign the sale admin workflow or sale item CRUD logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}