{
  "kind": "build_request",
  "title": "Integrate active sale pricing into public product data (strict date validation)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Motoko backend to return public product data with integrated active sale information (sale price, discount percentage, and on-sale flag) for these methods: `getProductsPageFeaturedFirst()`, `getHomepageCategories()`, and `getProduct()`. Sale fields must only be present/true when the sale is currently valid per strict time-window validation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update three Motoko backend functions to return product data with integrated active sale price information",
          "Three Backend Methods: getProductsPageFeaturedFirst(), getHomepageCategories(), getProduct()",
          "Each product must include: Original price, Sale price (optional), Discount percentage, Boolean flag indicating if product is currently on sale"
        ]
      },
      "acceptanceCriteria": [
        "`getProductsPageFeaturedFirst()` returns products where each item includes the original product data plus computed sale fields (`salePrice?`, `discountPercentage?`, `isOnSale`).",
        "`getHomepageCategories()` returns categories and associated products where each product includes the same sale fields.",
        "`getProduct()` returns a single product response that includes the same sale fields (so the product details page and modal can display sale pricing).",
        "For products with no active/valid sale, the response omits/returns null for `salePrice` and `discountPercentage`, and sets `isOnSale` to false.",
        "No backend state is modified by these reads (all remain query-safe)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a shared, reusable Motoko helper used by all three public product methods that resolves the active sale for a given product barcode by scanning `saleItems` and applying strict validation: sale must have `isActive == true` and current time must be within the sale period using system time (nanoseconds since Unix epoch). Enforce boundary rules so expired and future sales never return sale data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Shared Helper Function: Create reusable function to determine valid sale price for a product barcode",
          "Verify sale is active (isActive field is true)",
          "Current timestamp must be BETWEEN sale start and end dates (inclusive)",
          "NEVER show sale price for expired sales",
          "NEVER show sale price for future sales"
        ]
      },
      "acceptanceCriteria": [
        "Helper returns `null`/empty when there is no matching sale item, the sale is inactive, `now < startDate`, or `now > endDate`.",
        "Helper returns sale data only when `startDate <= now <= endDate` (inclusive) and `isActive == true`.",
        "If multiple sale items match a product barcode, the helper deterministically selects one active-valid sale (documented in code, e.g., best discount or nearest end date) and never returns an expired/future sale.",
        "Discount percentage is computed only when a valid sale applies and the product has a non-null original price; otherwise it is null/0 per existing conventions.",
        "Date/time comparisons are performed on `Int` nanosecond timestamps using `Time.now()` (or an existing internal timestamp helper), with consistent comparisons across all three endpoints."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the backend uses existing shared utilities/patterns for (a) BigInt/Int serialization of timestamps and (b) numeric conversion/price calculation consistency, and maintains existing function signatures where possible (or updates frontend bindings accordingly when signatures must change).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "MANDATORY UTILITIES USAGE: This implementation MUST use existing shared utilities where applicable: BigInt serialization for date handling, Numeric conversion utilities for price calculations, Consistent error handling patterns",
          "Maintain existing function signatures where possible"
        ]
      },
      "acceptanceCriteria": [
        "Backend sale-period comparisons are implemented using the existing timestamp representation already used in `SaleItem.startDate/endDate` (nanosecond `Int`).",
        "Frontend continues to parse and handle backend timestamps/prices without JSON BigInt loss, using the project’s existing BigInt-safe parsing utilities where applicable.",
        "If any Candid type changes are required (e.g., product response type expands), the generated frontend backend typings continue to compile without `any` casts."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update all public-facing frontend price displays to show sale pricing only when the backend indicates a currently-active valid sale, and never show sale pricing for expired or future sales. This must be consistent across: home page product cards, category page product cards, search results product cards, product details modal, and standalone product details page (`/product/$barcode`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Strict Price Display Rules for All Public Interfaces",
          "Product Details Modal ... Must display sale price when product has valid active sale ... Display discount percentage ... Show \"En Oferta\" badge or similar indicator",
          "Product Details Page ... Display sale price ONLY if sale is currently active AND within date range",
          "Integration Points: ... Search results product cards"
        ]
      },
      "acceptanceCriteria": [
        "Home page and category page product cards display sale price + strikethrough original price + discount badge only when the product is flagged as on sale by the backend payload for that card.",
        "Search results items show sale price + strikethrough original price only when the backend indicates the sale is active/valid; otherwise they show original price only.",
        "Product details modal displays (when on sale): an \"On Sale\" indicator (English text), sale price, original price with strikethrough, and discount percentage; when not on sale it shows only the original price and no sale indicators.",
        "Standalone product page displays (when on sale): sale price, original price with strikethrough, discount percentage, and an \"On Sale\" indicator (English text); when not on sale it shows only the original price.",
        "No UI path shows sale price for a product where `isOnSale`/`saleIsActive` is false or sale fields are missing/null."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the public product details page data flow so it can render sale-aware product details (sale price, discount percentage, on-sale flag) returned by the backend `getProduct()` (or an updated equivalent), rather than only rendering the base product price.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "getProduct() - Returns single product details for product page and modal",
          "Product Details Page ... Display sale price ONLY if sale is currently active AND within date range"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/pages/public/ProductPage.tsx` renders sale-aware pricing based on the updated backend response type.",
        "The React Query hook used by ProductPage (currently `useGetProduct` in `frontend/src/hooks/useProductQueries.ts`) is updated/extended to fetch and map sale-aware product data.",
        "ProductPage UI remains functional for products with missing price (null/undefined), showing the existing fallback where appropriate."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update the product details modal to include the discount percentage and a clear on-sale badge/label when a valid sale exists, matching the same strict on-sale rules as other public components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Details Modal ... Display discount percentage ... Show \"En Oferta\" badge or similar indicator"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/public/product/ProductDetailsModal.tsx` shows a discount percentage only when sale is active/valid and the backend provides the value.",
        "The modal shows an English on-sale badge/label (e.g., \"On Sale\") only when sale is active/valid; it is absent otherwise.",
        "The modal never shows sale UI if `isOnSale`/`saleIsActive` is false or sale fields are null/undefined."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; implement all Motoko logic in `backend/main.mo` (no extra backend services).",
    "Do not modify immutable frontend paths listed in SYSTEM_CONTEXT (compose existing UI components instead of editing them).",
    "Do not remove, modify, or overwrite the `:root` CSS custom properties block in `frontend/src/index.css`; append new CSS only below it if needed.",
    "Use English for any new/changed user-facing text introduced by this change request."
  ],
  "nonGoals": [
    "Do not implement new admin sale-management features (CRUD/UI) beyond what already exists.",
    "Do not add third-party services, databases, or external caching layers.",
    "Do not change authentication behavior (Internet Identity) or session keep-alive behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}