{
  "kind": "build_request",
  "title": "Make specified backend read endpoints permanently public (remove checkUser calls)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In `backend/main.mo`, remove all invocations of `checkUser(caller)` from the actor codebase so that the affected endpoints no longer require any authenticated-user permission check. This includes, at minimum, removing the `checkUser(caller);` statement from the following query functions: `getAllCategories` (currently calls `checkUser`), `getCategoryById` (currently calls `checkUser`), `getProductPhoto` (currently calls `checkUser`), `getTotalProductCount` (currently calls `checkUser`), `getFeaturedProducts` (currently calls `checkUser`), and `getActiveSales` (currently calls `checkUser`). Also remove `checkUser(caller)` calls from any other functions present in the file (even if not listed here) so that there are zero call sites remaining.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Remove all calls to `checkUser(caller)` completely from the code."
        ]
      },
      "acceptanceCriteria": [
        "A text search over the backend code confirms there are no remaining call sites of `checkUser(caller)` (i.e., no `checkUser(` usage remains).",
        "The canister compiles successfully after the refactor.",
        "All functions that previously used `checkUser(caller)` continue to return the same data and trap for the same non-auth related conditions as before (e.g., missing product/photo), but they do not trap due to user authentication anymore."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the following backend functions are permanently public and contain no authentication, permission, or user-identity gating logic of any kind (including but not limited to `checkUser`, `AccessControl.hasPermission(... #user)`, or any similar checks), while preserving existing `checkAdmin(caller)` enforcement wherever it currently applies: `getBothStoreDetails`, `getAllCategories`, `getProduct`, `getProductPhoto`, `getTotalProductCount`, `getFeaturedProducts`, `getActiveSales`, `getHomepageCategories`, `getCategoryProductCounts`, `getProductsPageFeaturedFirst`, `searchHomepageProducts`. If any of these functions currently perform a user-permission check via something other than `checkUser`, remove that user-permission check as well. Do not change the functions’ non-auth logic or response shapes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "These functions should be fully public and accessible by anyone without authentication.",
          "Keep admin checks (`checkAdmin(caller)`) intact — do not remove or modify them.",
          "The functions affected include (but are not limited to): ..."
        ]
      },
      "acceptanceCriteria": [
        "Each listed function can be called by an anonymous/non-authenticated caller without trapping for authorization reasons.",
        "No listed function contains a call to `checkUser` or a direct permission check such as `AccessControl.hasPermission(..., #user)` (or equivalent user-auth gating).",
        "Any admin-only functions continue to enforce admin authorization exactly as before (no `checkAdmin` removal or weakening)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an explicit, durable in-code guardrail comment in `backend/main.mo` immediately above each of the permanently-public functions listed in REQ-2 stating that the function is permanently public and must never add authentication/permission checks (including `checkUser` or similar) in future changes. The comment must be clear and unambiguous and must not alter runtime behavior.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "This change is permanent. Under no circumstances, now or in the future, should any of these functions ever check authentication, permissions, or call `checkUser` or any similar method.",
          "Ensure that future AI-generated code or modifications respect this rule and never add authentication checks to these functions again."
        ]
      },
      "acceptanceCriteria": [
        "Each permanently-public function listed in REQ-2 has a prominent comment directly above it stating it must remain permanently public and must not gain auth checks in the future.",
        "No runtime logic changes are introduced by these comments (compile output unchanged except for auth-check removals requested elsewhere)."
      ]
    }
  ],
  "constraints": [
    "Backend-only change: do not modify any frontend code or behavior.",
    "Do not remove, modify, or overwrite the `:root` CSS custom properties block in `frontend/src/index.css` (theme variables). If any frontend CSS changes ever become necessary later, they must be appended below that block without altering it.",
    "Do not remove or modify any admin checks (`checkAdmin(caller)`) or otherwise weaken admin-only protections.",
    "Keep the actor compiling and otherwise behaving the same, except for removing user-auth requirements from the specified permanently-public functions."
  ],
  "nonGoals": [
    "Adding new frontend UI or changing any existing UI flows.",
    "Changing data models, return types, or response shapes of the affected endpoints beyond removing authentication gates.",
    "Implementing new authentication methods or changing Internet Identity integration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}