{
  "kind": "build_request",
  "title": "Home page responsive layout refinements (banner position, search width, mobile category header)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Adjust the home page hero banner background position ONLY on desktop (>=768px): apply `background-position-y: -170px` to the banner background image container, while preserving the current banner appearance on mobile (<768px). Use Tailwind responsive utilities / arbitrary properties if possible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Apply `background-position-y: -170px` to the home page banner image container\n- This adjustment should only apply to desktop screens (768px and wider)\n- Mobile screens should not receive this background position adjustment"
        ]
      },
      "acceptanceCriteria": [
        "On screens >= 768px, the banner background is shifted vertically by -170px (Y axis).",
        "On screens < 768px, the banner background position matches the current production behavior (no Y shift applied).",
        "Change is implemented via responsive Tailwind classes/arbitrary properties when feasible (no global breaking changes)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expand the homepage search box container width on desktop so it aligns with the page container (max 1200px) and matches the width/edges of the category headers and product grid containers below. Preserve current search box width behavior on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Expand search box width to match the full width of the page container (1200px maximum on desktop)\n- The search box should align with the categories section below it\n- On mobile, maintain current search box width behavior"
        ]
      },
      "acceptanceCriteria": [
        "On desktop (>=768px), the search bar spans the full available width of the 1200px page container (no narrower max-width constraint).",
        "Left/right edges of the search bar align with the content edges used by the category sections/product grids below.",
        "On mobile, the search bar retains its current width constraints and centering behavior."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the mobile category header layout in the homepage category sections: (a) move the product count to appear below the category name on mobile, left-aligned, in a smaller secondary style; (b) truncate long category names on mobile to prevent wrapping (use an ellipsis, target ~20–25 characters); (c) reduce the \"Ver todos\" link font size on mobile while keeping the desktop size unchanged. Use Tailwind responsive utilities (e.g., `md:` / `max-md:`) for layout and typography changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "On mobile screens, move product count to appear below the category name\n- Format: Display as \"[number] productos\" in smaller font size than category name\n- Category Name Truncation: Truncate category names after appropriate character count (e.g., 20-25 characters) with ellipsis\n- Reduce font size of \"Ver todo\" link on mobile screens\n- Desktop: Maintain full category name display and current link size"
        ]
      },
      "acceptanceCriteria": [
        "Mobile (<768px): category name renders on a single line (no wrapping) via truncation with ellipsis when needed (approx 20–25 chars).",
        "Mobile (<768px): product count is displayed beneath the category name, left-aligned, and uses a smaller, muted/secondary style.",
        "Mobile (<768px): the \"Ver todos\" link uses a smaller font size than desktop, remains clearly readable, and does not affect desktop sizing.",
        "Desktop (>=768px): category name is not truncated; product count remains inline next to the category name as currently displayed; \"Ver todos\" link size remains unchanged from current desktop behavior."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Preserve the existing `:root` CSS custom properties block in `frontend/src/index.css` exactly as-is (names, values, ordering, and structure). If any additional global CSS is required for these layout changes, append it only below the existing `:root` variables block without editing that block.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Do not remove, modify, or overwrite the :root CSS custom properties block in index.css containing all theme color variables. Always preserve the exact variable names, values, and structure, appending new CSS styles only below this block without changes."
        ]
      },
      "acceptanceCriteria": [
        "No edits are made inside the existing `:root { ... }` theme variables block in `frontend/src/index.css`.",
        "Any new global CSS (if needed) is added after the variables block and does not rename/restructure existing theme variables."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change; do not introduce backend changes for these UI layout adjustments.",
    "Use Tailwind CSS responsive utilities for all adjustments if possible (e.g., `md:`/`lg:` for desktop-only, `max-md:`/`sm:` for mobile-only).",
    "Do not remove, modify, or overwrite the `:root` CSS custom properties block in `frontend/src/index.css`; only append new CSS below it if required."
  ],
  "nonGoals": [
    "Do not change banner image URL, overlay gradient design, or hero text content beyond the specified background positioning behavior.",
    "Do not change autocomplete/search logic, query behavior, or backend search APIs.",
    "Do not redesign the homepage layout beyond the specified alignment, spacing, and responsive typography changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}