{
  "kind": "build_request",
  "title": "Standardize public product images with object-contain and fix search-to-modal image blob URL flow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Standardize product image rendering across all public-facing UI by applying Tailwind `object-contain` to every <img> that displays a product photo (including fallback/default images), while preserving all other existing classes and layout behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Apply `object-contain` CSS class to all product images across every public-facing component.",
          "Product Card on Homepage\n- Product Card on Category Page\n- Product Details Modal\n- Product Details Page\n- Any other public location where product images appear"
        ]
      },
      "acceptanceCriteria": [
        "On the homepage product cards, the product image uses `object-contain` (no cropping), and other existing classes (dimensions, hover effects, rounding, etc.) remain intact.",
        "On the category page product cards, the product image uses `object-contain` (no cropping).",
        "In the product details modal, the main product image uses `object-contain` (no cropping).",
        "On the product details page, the main product image uses `object-contain` (no cropping).",
        "Fallback/default images (when no photo exists) also render with `object-contain` wherever product images appear."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the backend `searchHomepageProducts` function to return complete product data including the binary `photo` field (stored as `?[Nat8]`) for each search result, and remove any attempt to return/construct a product image URL string. Keep the maximum result limit at 10 and preserve all other fields needed for UI display (e.g., name, barcode, category name/id, pricing, and sale fields if currently included).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Modify the `searchHomepageProducts` function to return the actual photo binary field for each product in the search results.",
          "Remove any attempt to return a product image URL field.",
          "Maintain the maximum limit of 10 search results to save bandwidth and ensure quick response times."
        ]
      },
      "acceptanceCriteria": [
        "`searchHomepageProducts` returns results where each item includes the binary `photo` field (or null) as stored in the product.",
        "`searchHomepageProducts` does not include/compute any image URL string field.",
        "`searchHomepageProducts` returns at most 10 results even if more matches exist.",
        "All non-photo fields previously required by the frontend search UI (name, categoryName, price/sale fields, barcode, etc.) are still present and correct."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the homepage autocomplete dropdown remains text-only: do not render product images, do not create blob URLs, and do not attempt any binary-to-image conversion inside dropdown item components; dropdown items must show only product name, category name, and formatted price (with sale formatting if applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Search results in the dropdown should NOT display product images.",
          "No image placeholder, no photo attempts, no binary data conversion for dropdown items."
        ]
      },
      "acceptanceCriteria": [
        "Autocomplete dropdown items render no <img> and do not call any image/blob helpers.",
        "Dropdown items display product name (primary), category name (secondary), and price formatting consistent with current behavior."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Fix the product details modal image rendering when opened from homepage search results by generating a blob URL from the binary `photo` data on search-result selection (click/keyboard select), attaching the blob URL to the modal-bound product object (or storing it alongside modal state), and updating the modal to prefer the blob URL when present and otherwise fall back to the default image; the modal must not make any additional API calls to fetch photos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "When a user clicks a search result, receive the complete product data including the binary photo field.",
          "If photo data exists, generate a blob URL by creating a blob from the binary data.",
          "Attach this blob URL to the product data object.\nPass the enhanced product data to the modal opening function.",
          "The modal should check for the blob URL first and use that if available.\nFall back to the default image if no blob URL exists.\nThe modal should not make any additional API calls for photos."
        ]
      },
      "acceptanceCriteria": [
        "Selecting a search result opens the existing product details modal and displays the correct product image when the search result includes binary `photo` data.",
        "If a selected search result has no photo (null/empty), the modal displays the existing default fallback image.",
        "The modal uses a precomputed blob URL when provided and does not trigger any new backend calls to load product photos."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement blob URL lifecycle management for blob URLs created from binary product photos in the public UI (including the search-result-to-modal flow): track created blob URLs and revoke them when no longer needed (e.g., when the modal closes and/or when the active modal product changes) to prevent memory leaks; do not revoke blob URLs while they are still in use by a visible image element.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Track blob URLs created for search result products.",
          "Implement proper cleanup to revoke blob URLs when they are no longer needed to prevent memory leaks.\nConsider revoking URLs when the modal closes or when new search results are loaded."
        ]
      },
      "acceptanceCriteria": [
        "Blob URLs created for modal product images are revoked on an appropriate cleanup event (at minimum: modal close and/or product change).",
        "No console errors occur from revoking a blob URL that is still actively being used for the currently displayed modal image.",
        "Repeated open/close cycles of the modal from search selections do not continuously increase retained blob URLs (verified by code-level cleanup)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Maintain existing behavior for opening the product details modal from non-search entry points (e.g., clicking product cards on homepage/category grids) while aligning all public product image sources to the same data flow pattern: binary photo data → blob URL → image display, with correct fallback handling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Existing functionality for modal opening from regular cards must remain intact.",
          "All sources must follow the same pattern: binary photo data → blob URL → image display."
        ]
      },
      "acceptanceCriteria": [
        "Clicking a product card on homepage/category pages still opens the modal correctly and displays the product image or fallback as before (no regression).",
        "Public product image rendering uses binary photo data as the source of truth and displays via a blob URL (or default fallback) consistently across modal/page/cards."
      ]
    }
  ],
  "constraints": [
    "Do not modify any existing CSS classes or styling in `frontend/src/index.css` (additions only if absolutely necessary).",
    "Frontend files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, and `frontend/src/main.tsx` are immutable and must not be edited.",
    "Keep backend architecture as a single Motoko actor in `backend/main.mo`.",
    "Maintain Spanish UI (do not translate existing Spanish UI strings as part of this change).",
    "Search must return a maximum of 10 results to protect performance/bandwidth."
  ],
  "nonGoals": [
    "Adding product images to the autocomplete dropdown.",
    "Introducing new backend services, external storage, or third-party image hosting.",
    "Changing global styling beyond updating existing product image className strings to use `object-contain`.",
    "Adding new user-facing features unrelated to product images or homepage search-to-modal behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}