{
  "kind": "build_request",
  "title": "Public ProductCard: Hide missing price and remove stock text badge",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the public product card component (frontend/src/components/public/products/ProductCard.tsx) so that when the product has no price (product.price is undefined/null/missing and the product is not on an active sale), the card renders no price UI at all (no placeholder text and no empty price wrapper element for that case). Keep the existing regular price and sale price rendering logic unchanged when a valid price exists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Do not display any price element when `product.price` is undefined, null, or missing",
          "Remove the conditional text \"Precio no disponible\"",
          "If no price exists, render nothing in the price display area",
          "Regular price and sale price display logic remains unchanged for products with valid prices"
        ]
      },
      "acceptanceCriteria": [
        "For products not on sale where product.price is undefined/null/missing, the price area renders nothing (no 'Precio no disponible' text and no price container element for that branch).",
        "For products with a valid product.price and not on sale, the price renders exactly as before (same formatting and classes).",
        "For products on an active sale (isOnSale with a defined salePrice), sale price rendering remains exactly as before, including the optional struck-through regular price when present."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the same public product card component (frontend/src/components/public/products/ProductCard.tsx), remove the entire “Stock Status Text Badge” section below the price (the div that renders “Disponible”/“Agotado”). Do not change the stock badge overlay within the image area (the absolute-positioned badge) or any other badges/behaviors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove the entire `{/* Stock Status Text Badge */}` section",
          "Remove the div containing the \"Disponible\"/\"Agotado\" text badges",
          "Stock badge overlay in the image area must remain unchanged",
          "Only remove the text badge below the price, not the overlay badge on the image"
        ]
      },
      "acceptanceCriteria": [
        "The block that renders “Disponible”/“Agotado” below the price is removed from ProductCard.tsx.",
        "The stock overlay badge in the image area remains present and unchanged (positioning, text, styling).",
        "Featured badge, sale badge, click handler, image loading/fallback behavior, name truncation, and responsive layout remain unchanged."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change: do not modify backend code, backend API, or data structures.",
    "Limit code changes to a single component: frontend/src/components/public/products/ProductCard.tsx. Do not change product card props or TypeScript interfaces.",
    "Do not change any other components/pages; in particular, keep the home page search box width unchanged.",
    "Do not remove, modify, or overwrite the :root CSS custom properties block in frontend/src/index.css; preserve exact variable names, values, and structure. If any CSS must be added, append it only below that block (though no CSS changes are expected for this request)."
  ],
  "nonGoals": [
    "Refactoring pricing/sale logic beyond removing the missing-price placeholder output.",
    "Changing any Spanish/English copy outside the specified removals (only remove the specified placeholder/badges).",
    "Any layout redesign or visual theme updates.",
    "Adding new tests, routes, or backend validations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}