{
  "kind": "build_request",
  "title": "Allow public access to featured-first product pagination and fix PublicHeader edge alignment",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend query method `getProductsPageFeaturedFirst(search, categoryId, page, pageSize)` to allow unauthenticated (public) callers by removing the current permission/admin verification that traps with \"Unauthorized: Only authenticated users can view products\". Preserve the existing response type (`PaginatedResponse`), filtering behavior, featured-first sort order, pagination logic, and error/validation behavior unrelated to auth.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Method to Update: - `getProductsPageFeaturedFirst()`",
          "Required Fix: Remove admin verification from this method",
          "Current Issue: Public homepage cannot load category products without admin login"
        ]
      },
      "acceptanceCriteria": [
        "Calling `getProductsPageFeaturedFirst` from an anonymous principal (not logged in) succeeds and returns a `PaginatedResponse` rather than trapping for authorization.",
        "The returned `items` are still sorted with featured products first, and pagination (`page`, `pageSize`) continues to work as before.",
        "No admin checks are removed or loosened for any write/mutation methods (create/update/delete/toggle/reorder)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the public site header component (`frontend/src/components/public/PublicHeader.tsx`), reduce the hamburger menu visual size by changing the hamburger icon sizing class from `size-9` to `size-6` (apply the equivalent change to the element that currently controls the hamburger icon size). Ensure the hamburger remains visible on all screen sizes and keeps the same click/tap behavior (toggles the side panel).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Hamburger Menu Size Reduction: Current: Uses `size-9` class; Change to: `size-6` class",
          "Location: Header left side (visible on all screen sizes)"
        ]
      },
      "acceptanceCriteria": [
        "The hamburger menu icon renders at `size-6` (or equivalent) and remains clickable/tappable to open the side panel on all breakpoints.",
        "No layout regressions are introduced in the header height or spacing."
      ]
    },
    {
      "id": "REQ-3",
      "text": "In the public site header component (`frontend/src/components/public/PublicHeader.tsx`), remove the `px-4` class from the desktop-only Contact link so it aligns with the right content boundary while keeping existing typography, hover styles, and vertical padding intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Contact Link Padding Removal: Current: Contact \"a\" link has `px-4` class (visible on desktop only); Change: Remove `px-4` class from contact link"
        ]
      },
      "acceptanceCriteria": [
        "On desktop breakpoints, the Contact link no longer includes `px-4` horizontal padding.",
        "The Contact link remains hidden on mobile and visible on desktop, and still navigates to `/contacto`.",
        "Header left/right edges align consistently with the page content container boundaries (`max-w-[1200px] px-4`)."
      ]
    }
  ],
  "constraints": [
    "Do not remove, modify, or overwrite the `:root` CSS custom properties block in `frontend/src/index.css` containing all theme color variables. Preserve the exact variable names, values, and structure; append any new CSS styles only below this block without changes.",
    "Backend must remain single-actor (all Motoko logic in `backend/main.mo`).",
    "Use English for any new or modified user-facing text introduced by these changes."
  ],
  "nonGoals": [
    "Do not change authorization requirements for any admin-only write operations (create/update/delete/reorder/toggles).",
    "Do not redesign the public header beyond the specified hamburger size and Contact link padding adjustments.",
    "Do not change other product/category/store query endpoints unless required to implement the above fixes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}