{
  "kind": "build_request",
  "title": "Admin category dropdown: limit height to 10 items with vertical scroll (Products filter + Product modal)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an opt-in way to style the dropdown menu container for SafeSelect so specific callers can apply a max-height and scrolling without changing default behavior of other selects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix category dropdowns in the admin products page by adding height limits and scroll functionality when there are many categories. This is a front end only change. This change should not impact any other pages/designs"
        ]
      },
      "acceptanceCriteria": [
        "SafeSelect supports passing a class name (or equivalent) specifically to the rendered SelectContent element (dropdown menu container).",
        "If the new prop is not provided, SafeSelect renders exactly as before (no visual/layout changes to other dropdowns)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the new SafeSelect dropdown content styling to the Admin Products page category filter dropdown so it displays at most 10 category items at once and becomes vertically scrollable when there are more than 10 categories.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Admin Products Page: Category filter dropdown above products table",
          "Maximum Display: Show maximum 10 category items in dropdown view",
          "Scroll Functionality: Add vertical scrolling when category list exceeds 10 items"
        ]
      },
      "acceptanceCriteria": [
        "On the admin Products page, the category filter dropdown menu has a max height approximately equal to 10 option rows and shows a vertical scrollbar when options exceed that height.",
        "Keyboard navigation (arrow keys, enter, escape) continues to work within the scrollable list.",
        "The change is scoped to this dropdown only (no changes to other dropdowns/pages)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply the same max-height (10 items) + vertical scrolling behavior to the category selection dropdown inside the Add/Edit Product modal (ProductUpsertModal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add/Edit Product Modal: Category selection dropdown in form",
          "Both dropdowns show all categories without height limits, causing UI overflow when there are many categories."
        ]
      },
      "acceptanceCriteria": [
        "In the Add/Edit Product modal, the category dropdown menu has a max height approximately equal to 10 option rows and shows a vertical scrollbar when options exceed that height.",
        "Dropdown remains usable on mobile (touch scrolling works; the dropdown stays positioned on-screen).",
        "No other form controls or modal layout are impacted."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create new, admin-specific CSS styles to implement the scrollable dropdown menu (max-height, overflow-y) and a clean scrollbar that matches the existing admin theme; ensure smooth touch scrolling with momentum and preserve accessibility. Append styles without modifying the existing :root CSS custom properties block in frontend/src/index.css.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Do not impact other categories list. Create new css styling if needed",
          "Touch scrolling with momentum physics",
          "Do not remove, modify, or overwrite the :root CSS custom properties block in index.css. Always preserve the exact variable names, values, and structure, appending new CSS styles only below this block without changes."
        ]
      },
      "acceptanceCriteria": [
        "A new, uniquely-scoped CSS class (admin-only) is added for the dropdown content container to set max-height (10 items), overflow-y:auto, and touch momentum scrolling (-webkit-overflow-scrolling: touch).",
        "Scrollbar styling is applied only to this new admin dropdown class (does not affect public side panel categories scrollbar styles or any other lists).",
        "frontend/src/index.css :root blocks remain unchanged; new CSS is appended below the existing content."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change (no backend changes).",
    "Do not remove, modify, or overwrite the :root CSS custom properties block in frontend/src/index.css; only append new styles below it.",
    "Do not edit files under frontend/src/components/ui (read-only shadcn sources); compose/extend behavior from application components instead.",
    "Change must not impact other pages/designs; scope styling to admin category dropdowns only."
  ],
  "nonGoals": [
    "Reworking the overall admin Products page layout or table UI.",
    "Changing category fetching, sorting, or backend category APIs.",
    "Adding new category management features.",
    "Restyling dropdowns globally across the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}