{
  "kind": "build_request",
  "title": "Home page mobile header, banner height, and scroll-triggered category loading",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Update the public header so that the \"Contacto\" navigation link is hidden on mobile screens while remaining visible on desktop, and ensure the \"Contacto\" link remains available in the left side panel navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove the \"Contacto\" link from the mobile header",
          "Keep the \"Contacto\" link in the left side panel navigation where it currently exists",
          "Mobile header should only show hamburger menu icon and logo",
          "Desktop header behavior remains unchanged"
        ]
      },
      "acceptanceCriteria": [
        "On mobile breakpoints, the header shows only the hamburger menu button and the logo/brand link (no \"Contacto\" link).",
        "On desktop breakpoints, the header still shows the \"Contacto\" link as it does today.",
        "The side panel navigation still includes the \"Contacto\" link and it continues to navigate to /contacto.",
        "No other header navigation behavior is changed."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Replace the current IntersectionObserver-based automatic infinite scroll on the home page categories list with a throttled window scroll listener that triggers loading only when the user scrolls within 500px of the bottom of the page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Change from automatic infinite scroll to manual trigger loading",
          "Implement scroll event listener with proper throttling for performance",
          "Calculate distance to page bottom dynamically",
          "Trigger loading when user scrolls within 500px of page bottom",
          "Load only when user actively scrolls near bottom, not automatically"
        ]
      },
      "acceptanceCriteria": [
        "Homepage category loading is not triggered by an IntersectionObserver sentinel (remove/disable sentinel-based triggering).",
        "A scroll event listener is used, and it is throttled to avoid excessive calls during rapid scrolling.",
        "Distance-to-bottom is computed dynamically from document height and current scroll position.",
        "A load is triggered only when the user scrolls and the distance to bottom is <= 500px, and only when not already fetching and when more categories exist."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Change home page category pagination so that each scroll trigger loads and appends exactly 5 additional categories (including their associated products per existing implementation), preserving the existing ordering by the category order field and never replacing/resetting categories already rendered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When user scrolls near the bottom of the page (within 500px threshold), load and append 5 additional categories",
          "Each loaded category should include its associated products as per current implementation",
          "Newly loaded categories should appear below existing categories on the page",
          "Append new categories to existing display without replacing or resetting",
          "Maintain category ordering by existing order field",
          "Track total number of categories to determine when all have been loaded"
        ]
      },
      "acceptanceCriteria": [
        "Initial home page render shows the first page of categories (as currently implemented), and subsequent loads append additional categories below the existing ones.",
        "Each scroll-triggered load requests 5 categories per page (page size = 5 for incremental loads).",
        "Loaded categories include their products exactly as returned today by the existing homepage categories query logic.",
        "Category ordering remains consistent with the backend-provided ordering (by the existing order field).",
        "The UI tracks total categories and correctly determines when all categories are loaded (hasMore becomes false at the right time).",
        "No duplicate categories are appended when loading multiple pages."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Implement and display home page category loading states beneath the last loaded category: show a centered spinner with the exact Spanish text \"Cargando más categorías...\" during incremental fetches, and when all categories are loaded replace it with the persistent Spanish message \"No hay más categorías para mostrar\" until the user leaves the page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Show a loading spinner with Spanish text \"Cargando más categorías...\" while new categories are being fetched",
          "When all categories have been loaded, display a Spanish message \"No hay más categorías para mostrar\" where the loading indicator would appear",
          "Show loading indicator below the last loaded category, centered horizontally",
          "The \"no more categories\" message should replace the loading indicator when all categories are loaded",
          "The end message should remain visible until user leaves the page",
          "Spanish interface throughout"
        ]
      },
      "acceptanceCriteria": [
        "While additional categories are being fetched (incremental fetch), a spinner is shown centered below the last rendered category with the text \"Cargando más categorías...\".",
        "When there are no more categories to load, the loading area shows only \"No hay más categorías para mostrar\" and the message remains visible without disappearing or reverting.",
        "The loading/end-of-content UI is positioned below the last loaded category and centered horizontally.",
        "All displayed strings for these states match the required Spanish text exactly."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Reduce the home page banner height by 20% on mobile screens only, keeping the desktop banner height unchanged, using responsive CSS media queries added to frontend/src/index.css without modifying the existing :root CSS variables block.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Reduce the home page banner height by 20% on mobile devices only",
          "Desktop banner height remains unchanged",
          "Use responsive CSS media queries to apply height reduction only on mobile screens",
          "Banner content and layout should adjust proportionally to the reduced height",
          "Do not remove, modify, or overwrite the :root CSS custom properties block in index.css containing all theme color variables. Always preserve the exact variable names, values, and structure, appending new CSS styles only below this block without changes."
        ]
      },
      "acceptanceCriteria": [
        "On mobile breakpoints, the banner height is reduced by 20% relative to its current mobile height (e.g., 400px becomes 320px).",
        "On desktop breakpoints, the banner height remains unchanged compared to current behavior.",
        "The banner’s text remains readable and remains properly positioned within the reduced banner height (no clipping/overlap).",
        "Any new CSS required for the mobile-only height adjustment is appended below the existing :root theme variables block in frontend/src/index.css, and the :root block is left completely unchanged (same variable names, values, and structure)."
      ]
    }
  ],
  "constraints": [
    "Do not remove, modify, or overwrite the existing :root CSS custom properties block in frontend/src/index.css; only append new CSS styles below it.",
    "Do not change desktop header behavior; only remove the \"Contacto\" link from the mobile header view.",
    "Do not remove the \"Contacto\" link from the public side panel navigation.",
    "Do not change existing product rendering logic within each category section (including current mobile product limits).",
    "Use the exact Spanish UI strings provided for loading/end-of-content states: \"Cargando más categorías...\" and \"No hay más categorías para mostrar\"."
  ],
  "nonGoals": [
    "Do not introduce new routes or new navigation items beyond hiding the existing mobile header \"Contacto\" link.",
    "Do not change backend canister methods or backend data models for this request.",
    "Do not redesign the homepage layout beyond the specified banner height adjustment and scroll-loading behavior change.",
    "Do not add third-party scrolling/infinite-scroll libraries."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}