{
  "kind": "build_request",
  "title": "Update Privacy Policy contact section to link to /contacto (remove hardcoded store details)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the Privacy Policy page (/privacy), update only Section 12 \"Contacto\" to remove the hardcoded store contact details and replace them with a single contact paragraph plus a standalone router Link to the contact page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update the privacy policy contact section to link to the contact page instead of displaying store contact details. This is a frontend-only change. Do not change anything else.",
          "Remove the entire div with class `bg-muted p-6 rounded-lg space-y-3`",
          "Use existing Link component from router",
          "Target: `/contacto` route",
          "Link text: \"Ir a la página de contacto\"",
          "Styling: `text-primary hover:underline` (maintain existing link styling)",
          "Do not modify any other sections of the privacy policy page"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/public/PrivacyPage.tsx, the Section 12 contact area no longer renders the div with class `bg-muted p-6 rounded-lg space-y-3`.",
        "Section 12 no longer displays any individual contact details (store name, email, phone, address) and does not include `mailto:` or `tel:` links.",
        "Section 12 retains an introductory paragraph, updated to: \"Si tienes preguntas, inquietudes o solicitudes relacionadas con esta Política de Privacidad o nuestras prácticas de datos, contáctanos a través de nuestra página de contacto.\"",
        "Immediately after that paragraph, Section 12 renders a Link (from @tanstack/react-router) pointing to `/contacto` with visible link text exactly \"Ir a la página de contacto\" and className exactly `text-primary hover:underline`.",
        "No other sections, headings, layout, or styling on /privacy are modified outside Section 12.",
        "No backend changes are made."
      ]
    }
  ],
  "constraints": [
    "Frontend-only change; do not modify backend files.",
    "Do not modify the contact page (/contacto) or any other components/pages besides the Section 12 contact section on /privacy.",
    "Do not introduce data fetching, loading states, fallback handling, or error handling for this contact section update.",
    "Maintain Spanish UI content on the Privacy page.",
    "Do not remove, modify, or overwrite the :root CSS custom properties block in frontend/src/index.css; if any CSS is added, it must be appended below the existing block without altering it."
  ],
  "nonGoals": [
    "Changing any other section (1–11, 13) of the Privacy Policy page.",
    "Changing routing configuration or adding new routes.",
    "Updating store details, footer contact info, product modal contact options, or any other place where contact information is displayed.",
    "Adding tests, analytics, or telemetry for this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}