{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin category dropdown scroll: opt-in SafeSelect SelectContent styling",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an opt-in SafeSelect prop to style the rendered SelectContent (dropdown menu container) without affecting existing selects.",
      "acceptanceCriteria": [
        "SafeSelect supports passing a class name (or equivalent) specifically to the rendered SelectContent element (dropdown menu container).",
        "If the new prop is not provided, SafeSelect renders exactly as before (no visual/layout changes to other dropdowns)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SafeSelect.tsx",
          "operation": "modify",
          "description": "Extend SafeSelect with an optional prop (e.g., contentClassName) that is forwarded to the SelectContent container from the shadcn-ui Select implementation, leaving current behavior unchanged when omitted. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/SafeSelect.test.tsx",
          "operation": "modify",
          "description": "Add/extend tests to confirm the new SafeSelect SelectContent styling prop is applied only when provided, and that existing renders remain unchanged when the prop is not passed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the Admin Products page category filter dropdown show ~10 items max with vertical scrolling for longer lists, scoped to that dropdown only.",
      "acceptanceCriteria": [
        "On the admin Products page, the category filter dropdown menu has a max height approximately equal to 10 option rows and shows a vertical scrollbar when options exceed that height.",
        "Keyboard navigation (arrow keys, enter, escape) continues to work within the scrollable list.",
        "The change is scoped to this dropdown only (no changes to other dropdowns/pages)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/products/CategoryFilterSelect.tsx",
          "operation": "modify",
          "description": "Pass the new SafeSelect SelectContent styling prop to this filter dropdown only, using the new admin-scoped CSS class to enforce max-height and overflow scrolling (without changing other SafeSelect call sites). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/ProductsPage.tsx",
          "operation": "modify",
          "description": "Verify the category filter dropdown usage remains scoped and correctly wired (no new routes/pages); adjust only if needed to ensure the admin-only dropdown content class is applied solely to this dropdown."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply the same ~10-items max-height + vertical scrolling to the category dropdown in the Add/Edit Product modal (ProductUpsertModal).",
      "acceptanceCriteria": [
        "In the Add/Edit Product modal, the category dropdown menu has a max height approximately equal to 10 option rows and shows a vertical scrollbar when options exceed that height.",
        "Dropdown remains usable on mobile (touch scrolling works; the dropdown stays positioned on-screen).",
        "No other form controls or modal layout are impacted."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/products/ProductUpsertModal.tsx",
          "operation": "modify",
          "description": "Pass the new SafeSelect SelectContent styling prop for the modal’s category selector, using the same admin-scoped CSS class so the dropdown list scrolls within a capped height and supports touch momentum scrolling on mobile. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Append new admin-scoped CSS to implement a scrollable SelectContent (max-height, overflow-y, momentum scrolling) with theme-matching scrollbar styling, without changing :root variables.",
      "acceptanceCriteria": [
        "A new, uniquely-scoped CSS class (admin-only) is added for the dropdown content container to set max-height (10 items), overflow-y:auto, and touch momentum scrolling (-webkit-overflow-scrolling: touch).",
        "Scrollbar styling is applied only to this new admin dropdown class (does not affect public side panel categories scrollbar styles or any other lists).",
        "frontend/src/index.css :root blocks remain unchanged; new CSS is appended below the existing content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Append (below existing content) a new admin-only class (e.g., .admin-category-select-content) that caps dropdown height to ~10 option rows and enables vertical scrolling, adds overscroll containment and -webkit-overflow-scrolling: touch, and applies scrollbar styling only within this class (including ::-webkit-scrollbar selectors and Firefox scrollbar properties). Do not remove, modify, or overwrite the existing :root CSS custom properties block; append new styles only."
        }
      ]
    }
  ]
}