{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Homepage responsive layout refinements (banner background position, search width alignment, mobile category header)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Shift the home hero banner background image vertically on desktop only using Tailwind responsive/arbitrary utilities.",
      "acceptanceCriteria": [
        "On screens >= 768px, the banner background is shifted vertically by -170px (Y axis).",
        "On screens < 768px, the banner background position matches the current production behavior (no Y shift applied).",
        "Change is implemented via responsive Tailwind classes/arbitrary properties when feasible (no global breaking changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/home/StoreBanner.tsx",
          "operation": "modify",
          "description": "Update the banner background image container classes to apply a desktop-only vertical background-position shift (md and up) using Tailwind responsive utilities/arbitrary property (e.g., md:[background-position-y:-170px]) while preserving the current mobile appearance."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the homepage search bar container match the full 1200px page container width on desktop while keeping the current mobile width behavior.",
      "acceptanceCriteria": [
        "On desktop (>=768px), the search bar spans the full available width of the 1200px page container (no narrower max-width constraint).",
        "Left/right edges of the search bar align with the content edges used by the category sections/product grids below.",
        "On mobile, the search bar retains its current width constraints and centering behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/home/search/SearchBar.tsx",
          "operation": "modify",
          "description": "Adjust the SearchBar outer wrapper width constraints so it remains centered/narrower on mobile (current max-width behavior), but becomes full-width within the 1200px container on desktop (e.g., keep max-w-* for base and override with md:max-w-none / md:w-full)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Refine homepage category section headers for mobile: stack product count under the name, truncate long names, and reduce the 'Ver todos' link font size on mobile only.",
      "acceptanceCriteria": [
        "Mobile (<768px): category name renders on a single line (no wrapping) via truncation with ellipsis when needed (approx 20–25 chars).",
        "Mobile (<768px): product count is displayed beneath the category name, left-aligned, and uses a smaller, muted/secondary style.",
        "Mobile (<768px): the \"Ver todos\" link uses a smaller font size than desktop, remains clearly readable, and does not affect desktop sizing.",
        "Desktop (>=768px): category name is not truncated; product count remains inline next to the category name as currently displayed; \"Ver todos\" link size remains unchanged from current desktop behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/home/CategorySection.tsx",
          "operation": "modify",
          "description": "Update the category header markup/classes to use a mobile-first stacked layout (name on top, count below) with Tailwind responsive utilities (e.g., flex-col on mobile, md:flex-row/md:items-baseline on desktop). Add mobile-only truncation/ellipsis for the category name (e.g., max-md:truncate with a max-md:max-w-[~24ch]) to prevent wrapping, and reduce the 'Ver todos' link font size on mobile only (e.g., text-sm md:text-base) without changing desktop behavior."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure the existing :root theme variables block in frontend/src/index.css remains untouched; only append any additional global CSS below it if needed.",
      "acceptanceCriteria": [
        "No edits are made inside the existing `:root { ... }` theme variables block in `frontend/src/index.css`.",
        "Any new global CSS (if needed) is added after the variables block and does not rename/restructure existing theme variables."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Do not modify the existing `:root { ... }` variables block. If any global CSS additions are necessary for the layout changes, append them only after the variables block (and keep the block’s names/values/order/structure exactly as-is). If no new CSS is needed, limit this change to a non-functional comment placed after the variables block to document the constraint."
        }
      ]
    }
  ]
}