{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Privacy page: replace Section 12 contact details with link to /contacto",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update only Section 12 (\"Contacto\") on /privacy to remove hardcoded store contact details and replace with a single paragraph plus a standalone router Link to /contacto.",
      "acceptanceCriteria": [
        "In frontend/src/pages/public/PrivacyPage.tsx, the Section 12 contact area no longer renders the div with class `bg-muted p-6 rounded-lg space-y-3`.",
        "Section 12 no longer displays any individual contact details (store name, email, phone, address) and does not include `mailto:` or `tel:` links.",
        "Section 12 retains an introductory paragraph, updated to: \"Si tienes preguntas, inquietudes o solicitudes relacionadas con esta Política de Privacidad o nuestras prácticas de datos, contáctanos a través de nuestra página de contacto.\"",
        "Immediately after that paragraph, Section 12 renders a Link (from @tanstack/react-router) pointing to `/contacto` with visible link text exactly \"Ir a la página de contacto\" and className exactly `text-primary hover:underline`.",
        "No other sections, headings, layout, or styling on /privacy are modified outside Section 12.",
        "No backend changes are made."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/public/PrivacyPage.tsx",
          "operation": "modify",
          "description": "Within Section 12 \"Contacto\" only: remove the entire hardcoded contact-details block (the div with class `bg-muted p-6 rounded-lg space-y-3`) and remove any remaining individual contact details and `mailto:`/`tel:` links. Replace the current intro paragraph text with exactly: \"Si tienes preguntas, inquietudes o solicitudes relacionadas con esta Política de Privacidad o nuestras prácticas de datos, contáctanos a través de nuestra página de contacto.\" Then render a standalone `Link` from `@tanstack/react-router` immediately after that paragraph with `to=\"/contacto\"`, visible text exactly \"Ir a la página de contacto\", and `className=\"text-primary hover:underline\"`. Do not change any other sections or styles outside Section 12, and do not add any fetching/loading/error logic."
        }
      ]
    }
  ]
}