{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "ProductCard: Hide missing price UI and remove stock text badge",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Hide the entire price UI on public ProductCard when no regular price exists and the product is not on an active sale, while preserving existing regular/sale price rendering when prices exist.",
      "acceptanceCriteria": [
        "For products not on sale where product.price is undefined/null/missing, the price area renders nothing (no 'Precio no disponible' text and no price container element for that branch).",
        "For products with a valid product.price and not on sale, the price renders exactly as before (same formatting and classes).",
        "For products on an active sale (isOnSale with a defined salePrice), sale price rendering remains exactly as before, including the optional struck-through regular price when present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/products/ProductCard.tsx",
          "operation": "modify",
          "description": "Adjust the price rendering branch so that when not on active sale and product.price is null/undefined/missing, render no price markup at all (remove the 'Precio no disponible' fallback and avoid rendering an empty price wrapper for that case), while keeping existing sale price and regular price UI (formatting/classes) unchanged when a valid price exists."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the below-price stock status text badge ('Disponible'/'Agotado') from the public ProductCard while keeping the stock overlay badge in the image area unchanged.",
      "acceptanceCriteria": [
        "The block that renders “Disponible”/“Agotado” below the price is removed from ProductCard.tsx.",
        "The stock overlay badge in the image area remains present and unchanged (positioning, text, styling).",
        "Featured badge, sale badge, click handler, image loading/fallback behavior, name truncation, and responsive layout remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/products/ProductCard.tsx",
          "operation": "modify",
          "description": "Remove the entire 'Stock Status Text Badge' section below the price (the non-overlay text badge div), without altering the stock badge overlay within the image area or any other badges/behaviors."
        }
      ]
    }
  ]
}