{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Standardize public product images (object-contain) and fix search-to-modal blob URL flow with cleanup",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Apply Tailwind `object-contain` to every public-facing product <img> (including fallbacks) without altering other styling/layout behaviors.",
      "acceptanceCriteria": [
        "On the homepage product cards, the product image uses `object-contain` (no cropping), and other existing classes (dimensions, hover effects, rounding, etc.) remain intact.",
        "On the category page product cards, the product image uses `object-contain` (no cropping).",
        "In the product details modal, the main product image uses `object-contain` (no cropping).",
        "On the product details page, the main product image uses `object-contain` (no cropping).",
        "Fallback/default images (when no photo exists) also render with `object-contain` wherever product images appear."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/products/ProductCard.tsx",
          "operation": "modify",
          "description": "Update the product photo <img> className to use `object-contain` (replacing `object-cover`) while preserving all other existing classes and behaviors (e.g., sizing, hover scale, transitions)."
        },
        {
          "path": "frontend/src/components/public/product/ProductDetailsModal.tsx",
          "operation": "modify",
          "description": "Update the modal main product <img> className to use `object-contain` (replacing `object-cover`) while preserving all other existing classes and layout."
        },
        {
          "path": "frontend/src/pages/public/ProductPage.tsx",
          "operation": "modify",
          "description": "Update the product page main product <img> className to use `object-contain` (replacing `object-cover`) while preserving all other existing classes and layout."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep the homepage autocomplete dropdown text-only with no image rendering and no blob/binary-to-image conversion in dropdown items.",
      "acceptanceCriteria": [
        "Autocomplete dropdown items render no <img> and do not call any image/blob helpers.",
        "Dropdown items display product name (primary), category name (secondary), and price formatting consistent with current behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/public/home/search/SearchResultItem.tsx",
          "operation": "modify",
          "description": "Add a guard against accidental image rendering/conversion by keeping this component strictly text-only (no <img>, no imports of product image/blob helpers), preserving current name/category/price formatting."
        },
        {
          "path": "frontend/src/components/public/home/search/AutocompleteDropdown.tsx",
          "operation": "modify",
          "description": "Ensure dropdown rendering remains text-only by continuing to render SearchResultItem without any image-related props or helpers, preserving current loading/error/empty states."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "When opening the product details modal from homepage search selection, generate and pass a blob URL derived from binary photo data and have the modal prefer it without additional photo fetches.",
      "acceptanceCriteria": [
        "Selecting a search result opens the existing product details modal and displays the correct product image when the search result includes binary `photo` data.",
        "If a selected search result has no photo (null/empty), the modal displays the existing default fallback image.",
        "The modal uses a precomputed blob URL when provided and does not trigger any new backend calls to load product photos."
      ],
      "file_operations": [
        {
          "path": "frontend/src/stores/productModalStore.ts",
          "operation": "modify",
          "description": "Extend modal state to store an optional precomputed product photo blob URL alongside the modal-bound product, and update open/close actions to set/clear this blob URL (without adding any new backend calls)."
        },
        {
          "path": "frontend/src/components/public/home/search/SearchBar.tsx",
          "operation": "modify",
          "description": "On search-result selection (click/keyboard selection handler), if binary `photo` exists, generate a blob URL and pass it alongside the selected product into the modal-open flow; ensure this happens only on selection (not within dropdown items) and does not trigger any additional backend calls."
        },
        {
          "path": "frontend/src/hooks/useProductModalNavigation.ts",
          "operation": "modify",
          "description": "Update `openModalWithHistory` to accept and forward an optional precomputed product photo blob URL into the modal store when opening the modal, while preserving existing history behavior for all sources."
        },
        {
          "path": "frontend/src/components/public/product/ProductDetailsModal.tsx",
          "operation": "modify",
          "description": "Update the modal image source selection to prefer the modal state's precomputed blob URL when present; otherwise fall back to deriving the image from binary photo data or default fallback, and ensure the modal does not attempt any additional photo-fetching backend calls."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Manage blob URL lifecycle for public UI product images by revoking created URLs on cleanup events without breaking visible images.",
      "acceptanceCriteria": [
        "Blob URLs created for modal product images are revoked on an appropriate cleanup event (at minimum: modal close and/or product change).",
        "No console errors occur from revoking a blob URL that is still actively being used for the currently displayed modal image.",
        "Repeated open/close cycles of the modal from search selections do not continuously increase retained blob URLs (verified by code-level cleanup)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useProductPhotoBlobUrl.ts",
          "operation": "create",
          "description": "Create a dedicated hook that converts optional binary product photo data into a memoized blob URL and revokes the previous URL during cleanup when the photo changes or the component unmounts (to prevent memory leaks)."
        },
        {
          "path": "frontend/src/components/public/product/ProductDetailsModal.tsx",
          "operation": "modify",
          "description": "Implement modal-specific blob URL cleanup: when the modal closes and/or the active modal product changes, revoke any blob URL that was created for the modal image and is no longer in use; ensure the currently displayed image URL is not revoked prematurely."
        },
        {
          "path": "frontend/src/stores/productModalStore.ts",
          "operation": "modify",
          "description": "Ensure modal close/reset clears any stored precomputed blob URL reference so the modal does not retain stale blob URLs between open/close cycles."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Preserve modal opening behavior from non-search entry points while standardizing public product image rendering to binary photo → blob URL → image with fallback handling.",
      "acceptanceCriteria": [
        "Clicking a product card on homepage/category pages still opens the modal correctly and displays the product image or fallback as before (no regression).",
        "Public product image rendering uses binary photo data as the source of truth and displays via a blob URL (or default fallback) consistently across modal/page/cards."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/productImage.ts",
          "operation": "modify",
          "description": "Refactor public image utilities to support the standardized flow by exposing a shared default fallback URL and safe helpers for determining photo presence, without introducing any URL-string construction from the backend."
        },
        {
          "path": "frontend/src/components/public/products/ProductCard.tsx",
          "operation": "modify",
          "description": "Switch card image rendering to use the standardized binary photo → blob URL → display pattern (via the shared hook/util) with correct fallback, preserving existing modal-open behavior and all non-image UI."
        },
        {
          "path": "frontend/src/pages/public/ProductPage.tsx",
          "operation": "modify",
          "description": "Switch product page image rendering to use the standardized binary photo → blob URL → display pattern (via the shared hook/util) with correct fallback, preserving current page behavior and Spanish UI."
        },
        {
          "path": "frontend/src/components/public/product/ProductDetailsModal.tsx",
          "operation": "modify",
          "description": "Ensure the modal uses the same standardized image flow for all open sources (cards and search), preferring precomputed blob URL when provided, otherwise deriving from binary photo data with fallback."
        }
      ]
    }
  ]
}