{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Import page with automatic JSON validation and batch import",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new admin-only /admin/import page that accepts the existing export JSON format and maps it into the backend ImportData call shape.",
      "acceptanceCriteria": [
        "Visiting `/admin/import` as a non-admin shows the existing admin access denied flow (via AdminRoute protection).",
        "Visiting `/admin/import` as an admin renders the import UI (no blank page / route not found).",
        "The page accepts JSON files exported by `/admin/export` without needing manual edits to the file."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ImportPage.tsx",
          "operation": "create",
          "description": "Create the Import admin page UI shell and state machine (idle/validating/importing/completed/error) and ensure it reads the exported JSON shape (categories, products, exportTimestamp, itemCounts) while preparing data for the backend import call. Use the authorization component via the existing AdminRoute protection to keep the page admin-only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/router.tsx",
          "operation": "modify",
          "description": "Register the new `/admin/import` route under the existing `/admin` protected route tree and wire it to the new ImportPage component so the page is reachable and not a route-not-found."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add Import navigation entry after Export in the admin sidebar and admin dashboard cards.",
      "acceptanceCriteria": [
        "Admin sidebar shows an Import entry after Export and it navigates to `/admin/import`.",
        "Admin dashboard home shows an Import card after Export and it navigates to `/admin/import`.",
        "The active route styling in the sidebar works for `/admin/import` like other admin routes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminSidebar.tsx",
          "operation": "modify",
          "description": "Add an 'Importar' nav item after the existing 'Exportar' item, pointing to `/admin/import`, including an appropriate lucide icon, and ensure currentPath active styling applies for that route."
        },
        {
          "path": "frontend/src/pages/admin/DashboardHomePage.tsx",
          "operation": "modify",
          "description": "Add an 'Importar' dashboard navigation card after 'Exportar', linking to `/admin/import`, using the existing DashboardNavCard composition."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build Import page sections: import info, JSON-only dropzone/file picker, and cancel/clear that also stops in-progress work.",
      "acceptanceCriteria": [
        "After selecting a JSON file, the page shows: selected filename, categories count, products count, and a formatted export date.",
        "The page shows a clear valid/invalid indicator (green check vs red X) and a short compatibility message.",
        "The file input prevents non-JSON selection (accept attribute) and the dropzone rejects non-JSON drops with a Spanish error message.",
        "Clicking Cancel removes the selected file and resets validation/result state; if an import request is running, it is aborted/cancelled on the client side (e.g., AbortController) and the UI returns to idle."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ImportPage.tsx",
          "operation": "modify",
          "description": "Implement (1) Import Information section (filename, parsed counts, export date, validation status + compatibility message), (2) drag-and-drop + click-to-select area with `accept='.json,application/json'` and Spanish rejection messaging for non-JSON drops, and (3) a 'Cancelar importación' control that clears selected file + resets UI state and cancels in-flight FileReader/parsing/import flow via an AbortController-like pattern (best-effort cancellation, ensuring UI returns to idle)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement automatic client-side flow: read file, parse with parseJSONWithBigInt, validate/convert numeric fields, then auto-trigger backend import with coarse progress states.",
      "acceptanceCriteria": [
        "Selecting a valid export JSON automatically starts the import API call (no separate Submit/Import button).",
        "Parsing uses `parseJSONWithBigInt()` (not plain `JSON.parse`) to correctly handle BigInt-like timestamp fields.",
        "Client-side validation catches and displays (in Spanish) at least: invalid JSON, missing required fields, and type mismatches.",
        "All numeric fields are validated and converted before calling the backend (e.g., stringified numbers become numbers/bigints as required by the actor interface).",
        "UI shows a validating/loading state and then a completed state; it does not attempt real-time progress updates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/importValidation.ts",
          "operation": "create",
          "description": "Add reusable import parsing/validation helpers that: read parsed export JSON (including exportTimestamp and itemCounts), validate presence/types, validate numeric fields (including IDs/orders/dates/prices), and convert values into the actor-compatible ImportData shape (BigInt for bigint fields; number for numeric fields like price; booleans for flags). Use parseJSONWithBigInt() and NumericConverter utilities for safe conversions and produce Spanish validation error messages when failing."
        },
        {
          "path": "frontend/src/pages/admin/ImportPage.tsx",
          "operation": "modify",
          "description": "Wire the selection/drop flow to: FileReader read → parseJSONWithBigInt() → validate/convert via importValidation utilities → set status text in Spanish (e.g., 'Validando datos...', 'Importando...', 'Importación completada') → automatically start the import call immediately after validation success (no extra button). Ensure large-file scenarios keep UI responsive by using async breaks (e.g., microtask/setTimeout) around parsing/validation and by showing a loading state."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Call backend batch import via the shared actor utilities and standardized ApiResponseHandler-style error handling; show Spanish errors and a Spanish success toast summary.",
      "acceptanceCriteria": [
        "Import API failures are surfaced via a consistent Spanish message (no raw stack traces) and do not leave the UI stuck loading.",
        "On success, a toast appears with a Spanish summary of imported/updated categories and products.",
        "Large JSON files are handled gracefully: the UI remains responsive (shows loading state), and errors for oversized/slow parsing are reported clearly in Spanish."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminImport.ts",
          "operation": "create",
          "description": "Create a dedicated admin import hook that uses the existing actor from useActor to call `batchImportData(...)` and applies standardized ApiResponseHandler patterns by wrapping/normalizing thrown errors (e.g., via createApiError) into consistent Spanish user-facing messages; expose a single async function used by the ImportPage."
        },
        {
          "path": "frontend/src/pages/admin/ImportPage.tsx",
          "operation": "modify",
          "description": "Use the new useAdminImport hook to invoke the batch import call, handle success/failure via standardized patterns (ApiResponseHandler-style normalization + reportErrorWithToast), and show a Spanish success toast summarizing imported/updated counts from the ImportResult (and any error count messaging), ensuring loading state always resolves."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Show Import Results after completion with counts, links to Categories/Products pages, and a reset action to start another import.",
      "acceptanceCriteria": [
        "After a successful import, the results summary is visible on the page with category count, product count, and errors count if present.",
        "The page provides working links to `/admin/categories` and `/admin/products`.",
        "A Reset/Clear Results action returns the page to the initial state (no file selected, no validation status, no results)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ImportPage.tsx",
          "operation": "modify",
          "description": "Add an Import Results section rendered after import completion, showing counts from ImportResult (categories imported/updated, products imported/updated, and error count/messages if present), add navigation links to `/admin/categories` and `/admin/products`, and provide a reset button that returns the entire import UI to the initial idle state."
        }
      ]
    }
  ]
}